; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	thermograph1 - mode
	infrared2 - mode
	spectrograph4 - mode
	spectrograph6 - mode
	infrared3 - mode
	infrared5 - mode
	infrared0 - mode
	Star0 - direction
	Star4 - direction
	Star2 - direction
	Star1 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph6)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared5)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite1 Star8)
	(pointing satellite2 Phenomenon9)
	(have_image Phenomenon5 infrared5)
	(have_image Phenomenon5 spectrograph6)
	(have_image Star6 infrared0)
	(have_image Phenomenon7 spectrograph6)
	(have_image Star8 spectrograph4)
	(have_image Phenomenon9 infrared3)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon11 thermograph1)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 12
2. (calibrate satellite2 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 0 of 12
3. (turn_to satellite2 star6 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star6)
   goals met: 0 of 12
4. (take_image satellite2 star6 instrument4 infrared0)
   added: (have_image star6 infrared0)
   goals met: 1 of 12
5. (turn_to satellite2 phenomenon9 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 12
6. (turn_to satellite1 groundstation3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 12
7. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 12
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
9. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 12
10. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 12
11. (take_image satellite2 phenomenon9 instrument4 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 3 of 12
12. (turn_to satellite0 phenomenon11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 12
13. (take_image satellite0 phenomenon11 instrument0 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 4 of 12
14. (turn_to satellite0 phenomenon5 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 12
15. (take_image satellite0 phenomenon5 instrument0 infrared5)
   added: (have_image phenomenon5 infrared5)
   goals met: 5 of 12
16. (turn_to satellite0 star8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star8)
   goals met: 6 of 12
17. (take_image satellite0 star8 instrument0 spectrograph4)
   added: (have_image star8 spectrograph4)
   goals met: 7 of 12
18. (turn_to satellite1 phenomenon10 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon10)
   goals met: 7 of 12
19. (take_image satellite1 phenomenon10 instrument2 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 8 of 12
20. (turn_to satellite1 phenomenon5 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon5)
   goals met: 8 of 12
21. (take_image satellite1 phenomenon5 instrument2 spectrograph6)
   added: (have_image phenomenon5 spectrograph6)
   goals met: 9 of 12
22. (turn_to satellite1 phenomenon7 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon7)
   goals met: 9 of 12
23. (take_image satellite1 phenomenon7 instrument2 spectrograph6)
   added: (have_image phenomenon7 spectrograph6)
   goals met: 10 of 12
24. (turn_to satellite1 phenomenon9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon9)
   goals met: 10 of 12
25. (take_image satellite1 phenomenon9 instrument2 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 11 of 12
26. (turn_to satellite1 star8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star8)
   goals met: 12 of 12
